{
  "prototypes": [
    {
      "title": "Crepe bandage Applicator",
      "description": "",
      "category": [""],
      "year" : "2024",
      "inventors" : ["Honey Baranwal", "Mayur Kumar"],
      "images" : ["http://72.60.102.111:8000/media/uploads/crepe-bandage.png"],
      "video" : [""],
      "event" : "Invention Factory 2024"
    },
    {
      "title": "Fluid Flex Sensor ",
      "description": "",
      "category": [""],
      "year" : "2024",
      "inventors" : ["Romit Mohane", "Vinati Mehta"],
      "images" : ["http://72.60.102.111:8000/media/uploads/flexi-sensor.png"],
      "video" : [""],
      "event" : "Invention Factory 2024"
    },
    {
      "title": "Multi-Drug Injector",
      "description": "",
      "category": [""],
      "year" : "2024",
      "inventors" : ["Khushboo Rathore", "Varun Rawat"],
      "images" : [""],
      "video" : [""],
      "event" : "Invention Factory 2024"
    },
    {
      "title": "Self Lubricating Tampon",
      "description": "",
      "category": [""],
      "year" : "2024",
      "inventors" : ["Etka Sachan", "Aditya Jaiswal"],
      "images" : ["http://72.60.102.111:8000/media/uploads/self-lubricating-tampon.png"],
      "video" : [""],
      "event" : "Invention Factory 2024"
    },
    {
      "title": "Ankle Joint",
      "description": "",
      "category": [""],
      "year" : "",
      "inventors" : [""],
      "images" : ["http://72.60.102.111:8000/media/uploads/ankle-joint.png"],
      "video" : [""],
      "event" : ""
    },
    {
      "title": "Self Wrapping Pad",
      "description": "",
      "category": [""],
      "year" : "2024",
      "inventors" : ["Priyanshi", "Mukesh Dewangan"],
      "images" : ["http://72.60.102.111:8000/media/uploads/self-wrapping-pad.png"],
      "video" : [""],
      "event" : "Invention Factory 2024"
    },
    {
      "title": "Vibration Damping Gloves",
      "description": "",
      "category": [""],
      "year" : "",
      "inventors" : [""],
      "images" : [""],
      "video" : [""],
      "event" : ""
    },
    {
      "title": "Toothbrush Sterlizer",
      "description": "The present invention relates to a toothbrush sterilization device comprising a primary chamber into which a toothbrush is inserted through a front-facing transparent sliding lid. Inside the chamber, the bristle portion of the toothbrush is enclosed within an upper circular ring structure that directs sterilizing mist precisely to the root of the bristles. The mist is generated by an electrically operated atomization unit connected via an inlet tube and partially submerged in a refillable liquid reservoir. The upper portion of the atomizer remains outside the reservoir to emit the mist. An infrared (IR) sensor detects the presence of a toothbrush and automatically activates the misting process. After sterilization, residual mist or fumes dissipate naturally through the open bottom. All electronic control components are housed adjacent to the chamber for safety and ease of maintenance.",
      "category": [""],
      "year" : "2025",
      "inventors" : ["Abhay Gautam", "Charvi Sharma", "Ameen Al Mehboon"],
      "images" : ["http://72.60.102.111:8000/media/uploads/toothbrush-sterlizer.pdf"],
      "video" : [""],
      "event" : "InventX 2025"
    },
    {
      "title": "Larvae Extractor",
      "description": "Abstract:A device for extracting myiasis larvae from a host animal is disclosed. The device comprises a suction head with a first duct and a second duct integrally formed within a unitary structure. The first duct is in fluid communication with a vacuum source. The second duct is in fluid communication with a chemical delivery system that includes a multi-compartment unit for storing at least two precursor agents and a reaction chamber wherein the agents mix to form a suffocating gas. A control circuit is configured to first actuate the delivery system to apply the gas to an infestation site, and after a predetermined time delay, actuate the vacuum source to extract surfaced larvae through the first duct. The components are housed within a portable, self-contained body including a power source.",
      "category": [""],
      "year" : "2025",
      "inventors" : ["Anneasa Manna", "Parv Kathpal", "Sudhanshu Kumar"],
      "images" : ["http://72.60.102.111:8000/media/uploads/larvae.pdf"],
      "video" : [""],
      "event" : "InventX 2025"
    },
    {
      "title": "Compact Ashthama Spacer",
      "description": "A spacer for a metered-dose inhaler is disclosed. The spacer comprises a chamber having a bottom opening for receiving the mouthpiece of the inhaler and top opening for inhalation by a user. An obstruction is disposed within the chamber adjacent to the bottom opening to break flow and redirect the high velocity medication droplets towards chamber walls. One or more tangential inlets are formed in the chamber wall adjacent to the obstruction. The tangential inlets are configured to entrain ambient air into the chamber to mix with the medication and enhance droplet evaporation. The chamber has an internal surface geometry defining a sufficient path length for droplet evaporation prior to reaching the top opening. The device may remain coupled to the medication source and is shaped to support convenient, portable use.",
      "category": [""],
      "year" : "2025",
      "inventors" : ["Devanshee Kansara", "Nabil Suraj", "Jyotiraditya Bag"],
      "images" : ["http://72.60.102.111:8000/media/uploads/compact-ashtha.pdf"],
      "video" : [""],
      "event" : "InventX 2025"
    },
    {
      "title": "Inflatable Wound Shield",
      "description": "The present invention discloses a wound-protective device comprising a multi-layered structure designed to shield injured or sutured skin from external impact without contacting the wound. The device features an adhesive base layer for secure attachment to the skin surrounding the wound site. Above this base lies a dome-shaped cavity that encapsulates the wound dressing, maintaining a non-contact, slightly rigid interface. Positioned above this dome is a sealed, flexible chamber containing a chemical tablet. Upon user activation—by pressing the tablet—a chemical reaction occurs, releasing gas that inflates the chamber outwardly. This controlled, unidirectional inflation forms a cushioning dome that absorbs and redistributes mechanical forces. The outermost layer further enhances dissipation of external impact. The device transitions from a compact, deflated state to an expanded, protective form during use, offering a stable, sterile, and impact-resistant environment that promotes healing.",
      "category": [""],
      "year" : "2025",
      "inventors" : ["Khalid Nazir", "Swarnav Halder", "Divya"],
      "images" : ["http://72.60.102.111:8000/media/uploads/infatable-wound.pdf"],
      "video" : [""],
      "event" : "InventX 2025"
    },
    {
      "title": "Braille Display",
      "description": "",
      "category": [""],
      "year" : "2024",
      "inventors" : ["Aayusgi Bhansali", "Abhishek Kumar"],
      "images" : ["http://72.60.102.111:8000/media/uploads/braille-display.png"],
      "video" : [""],
      "event" : "Invention Factory 2024"
    },
    {
      "title": "Knee Brace",
      "description": "",
      "category": [""],
      "year" : "2024",
      "inventors" : ["Preksha Pandya", "Anirudhan S"],
      "images" : ["http://72.60.102.111:8000/media/uploads/knee-brace.png"],
      "video" : [""],
      "event" : "Invention Factory 2024"
    },
    {
      "title": "Automatice Eyeglass Cleaner ",
      "description": "",
      "category": [""],
      "year" : "",
      "inventors" : [""],
      "images" : [""],
      "video" : [""],
      "event" : ""
    },
    {
      "title": "Breathable Cast Maker",
      "description": "",
      "category": [""],
      "year" : "",
      "inventors" : [""],
      "images" : [""],
      "video" : [""],
      "event" : ""
    },
    {
      "title": "Smart Helmet Strap System",
      "description": "An emergency-responsive helmet strap adjustment system is disclosed. The device comprises a sensor that monitors acceleration and initiates a tightening sequence when a predefined threshold is exceeded. Prior to activation, the system remains in a standby state with stored energy. Upon triggering, the stored energy is rapidly released and used to pull the strap, securing the helmet firmly to the user’s head to prevent dislodging during an impact. The mechanism operates in fractions of a second and includes a provision for manual reset, allowing the spring to be returned to its preloaded state for reuse.",
      "category": [""],
      "year" : "2025",
      "inventors" : ["Kush Kapoor", "Arnav Varshney", "Tripti Rani"],
      "images" : ["http://72.60.102.111:8000/media/uploads/helmat-strap.jpg"],
      "video" : [""],
      "event" : "InventX 2025"
    },
    {
      "title": "Foot Drop Assistive Device",
      "description": "A shoe-mounted assistive device for individuals with impaired dorsiflexion is disclosed. The device comprises two primary components configured to attach respectively to the forefoot and rearfoot regions of a shoe. High tensile wires spanning between these components are arranged to apply controlled tension during the gait cycle to lift the forefoot. Specifically, during mid stance, the device remains inactive, permitting natural foot placement. From mid stance to pre-swing, the wires are positioned or pre-tensioned to prepare for activation. Upon entering pre-swing and terminal swing, controlled tension is applied to the wires, elevating the toe and facilitating foot clearance to replicate a physiological gait pattern. The system maintains partial tension during mid swing to optimize subsequent activation. The design offers a low-profile solution for enhancing gait dynamics in users with foot drop or similar impairments.",
      "category": [""],
      "year" : "2025",
      "inventors" : ["Sparsh Dubey", "Mahima Thakur", "Kaushik Kumar"],
      "images" : ["http://72.60.102.111:8000/media/uploads/assistive-foot.pdf"],
      "video" : [""],
      "event" : "InventX 2025"
    },
    {
      "title": "Assistive CPR Device",
      "description": "This invention relates to a portable manual chest compression device. It comprises a flat platform secured beneath a patient by adjustable belts, which also join a central sternum-mounted plunger with a soft interface connected via a bell-crank toggle force-amplification mechanism to a user-actuated handle. Pressing the handle transmits a controlled compression force to the sternum, after which the handle automatically resets to its initial position while maintaining continuous contact through the plunger assembly, enabling repeated compressions. Integrated electronic sensors such as LED indicators and a digital display provide real-time feedback on compression depth, force, and frequency. The assembly also features dedicated chambers for first-aid supplies, offering a compact, self-contained emergency response unit.",
      "category": [""],
      "year" : "2025",
      "inventors" : ["Aditya Agrawal", "Manashri Vashishtha", "Nakshat Thakkar"],
      "images" : ["http://72.60.102.111:8000/media/uploads/CPR-assistance.pdf"],
      "video" : [""],
      "event" : "InventX 2025"
    },
    {
      "title": "Toilet Swipe",
      "description": "",
      "category": [""],
      "year" : "2024",
      "inventors" : ["Dev Raval", "Anurag Ninawe"],
      "images" : ["http://72.60.102.111:8000/media/uploads/toilet-swipe.png"],
      "video" : [""],
      "event" : "Invention Factory 2024"
    },
    {
      "title": "Steam Operated Boil-Over Inhibitor",
      "description": "",
      "category": [""],
      "year" : "",
      "inventors" : [""],
      "images" : [""],
      "video" : [""],
      "event" : ""
    },
    {
      "title": "Volume-Controlled Oxygen Air-Blender For Neonatal CPAP",
      "description": "The invention relates to a gas blending apparatus designed to deliver a controlled mixture of oxygen and ambient air for respiratory support, particularly in neonatal CPAP therapy. The system operates through a dual-chamber reciprocating mechanism that enables continuous intake, mixing, and delivery of gases in defined proportions. Based on a user-selected target oxygen concentration (FiO2), the apparatus regulates the timing and quantity of oxygen introduced, after which ambient air is drawn to complete the mixture volume. The blended gas is then discharged in a continuous manner to the patient interface. Flow control is achieved through coordinated actuation and valving, ensuring precise FiO2 delivery without dependency on conventional high-pressure blending systems. The system is adaptable for low-resource environments and offers a compact, programmable alternative to traditional flow- or pressure-based blenders.",
      "category": [""],
      "year" : "2025",
      "inventors" : ["Swta Priya", "Cherish", "Piyush Kathoke"],
      "images" : ["http://72.60.102.111:8000/media/uploads/neonatal.pdf"],
      "video" : [""],
      "event" : "InventX 2025"
    },
    {
      "title": "Fire Extinguisher",
      "description": "The present invention relates to a water-based fire extinguisher training simulator designed to replicate the weight, pressure, and operational timing of a real fire extinguisher for hands-on training purposes. The system comprises a 6 kg training cylinder, pressurized using an external pump connected via a standard garden hose. Once the desired pressure is achieved, the user activates the system by pressing a push-button mounted on the extinguisher body. This triggers an Arduino-controlled solenoid valve, which opens for a fixed duration of 15 seconds, allowing water to discharge in a manner that mimics the behavior of an actual extinguisher. The valve then closes automatically, preventing water wastage and reinforcing time-sensitive response training. A digital display provides real-time visual feedback, indicating “Practice Started” at activation and “Practice Ended” upon valve closure. The system also includes a manual override option to abort the session if necessary. By closely simulating the pressure dynamics, discharge duration, and physical feel of a real extinguisher—while using only water for complete safety—this invention offers an effective, repeatable, and risk-free training solution suitable for all age groups, especially school children.",
      "category": [""],
      "year" : "2025",
      "inventors" : ["Aman Nagar", "Kriti Puri"],
      "images" : ["http://72.60.102.111:8000/media/uploads/fire-extingusher.pdf"],
      "video" : [""],
      "event" : "InventX 2025"
    }
    
  ]
}